# Pandas Operations:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1' : [1,2,3,4],
                   'col2' : [444,555,666,444],
                   'col3' : ['abc','def','ghi','xyz']
                  })
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df.head(2)
# This function returns the first `n` rows for the object based on position

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

---

## Finding Unique Values :
> **Syntax: `df_name[columnName].unique()`**

In [5]:
df['col2'].unique()

# returns NumPy array of all the Unique values of 'col2' by default.

array([444, 555, 666], dtype=int64)

---

## length of the unique values: 
> **Syntax: `df_name[columnName].nunique()`**

In [6]:
# length of the unique values in 'col2'
df['col2'].nunique()
# OR
# len(df['col2'].unique()

3

---

## Finding the occurance of Each values in particular column:
> **Syntax: `df_name['columnName'].value_counts()`**

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

---

# Selecting Data using Conditional Selection:

In [8]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [9]:
df[ df['col1']>2 ]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df[ (df['col1']>2) & (df['col2']==444) ]

   col1  col2 col3
3     4   444  xyz

---

# Selecting Data using Applied Method:
- **Applied Method is one of the most powerful tools in Pandas.**
- **Syntax: `df_name/ser_name.apply( funcName , axis=0)`**

In [11]:
def times2(x):
    return x*2
# OR
# times2 = lambda x : x*2

In [12]:
# Applying function to column/DataFrame
# df.apply(times2)
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
# Can also apply built-in functions using apply() method
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [14]:
# can also use Lambda expression
df['col2'].apply(lambda n: n**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [15]:
# stacking multiple times for using more than 1 functions
df['col2'].apply(str).apply(len)

0    3
1    3
2    3
3    3
Name: col2, dtype: int64

---

In [16]:
df.columns
#  Returns list of columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [17]:
df.index
# Returns index's list/range

RangeIndex(start=0, stop=4, step=1)

---

# Sorting and Ordering a Data Frame:
> **Syntax: `df_name.sort_values(by='columnName')`**

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
# Sorting by column wise, here 'col2'
df.sort_values('col2')
#inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

---

# More Methods:

### `df_name.isnull()` - returns 'true' the place having NULL/NaN values :

In [20]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

---

# Pivot Table :

In [21]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [22]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [23]:
df.pivot_table(values='D', index=['A','B'], columns='C')
# Don't worry not much used in our case
# Might helpful for advanced Excel users

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

---